import { antPath } from 'leaflet-ant-path';

const planeRoutes = [
    // Oslo - Ålesund
    [
        [60.19335566726187, 11.097022854113305],
        [62.5586291264617, 6.115283126333325],
    ],
    // Oslo - Kristansund
    [
        [60.19335566726187, 11.097022854113305],
        [63.114081426401384, 7.825450872135551]
    ],
    // Oslo - Trondheim
    [
        [60.19335566726187, 11.097022854113305],
        [63.454136845664685, 10.91735807576121]
    ],
    // Oslo - Bodø
    [
        [60.19335566726187, 11.097022854113305],
        [67.26684917948292, 14.361062899409713]
    ],
    // Oslo - Bardufoss
    [
        [60.19335566726187, 11.097022854113305],
        [69.0598396837238, 18.53791101688064]
    ],
    // Oslo - Tromsø
    [
        [60.19335566726187, 11.097022854113305],
        [69.67996197252181, 18.907340503861953]

    ],
    // Trondheim - Ålesund
    [
        [63.454136845664685, 10.91735807576121],
        [62.5586291264617, 6.115283126333325]
    ],
    // Lakselv - Tromsø
    [
        [70.0670575184383, 24.98239813572595],
        [69.67996197252181, 18.907340503861953]
    ]
]

const planePaths = []

planeRoutes.forEach(route => {
    planePaths.push(antPath(route, {
        "delay": 1000,
        "dashArray": [
            10,
            20
        ],
        "weight": 5,
        "color": "#FF0004",
        "pulseColor": "#FFFFFF",
        "paused": false,
        "reverse": false,
        "hardwareAccelerated": true
    }))
})

export default planePaths